<?php

return [
    'login' => 'Авторизация',
    'logout' => 'Выйти',
    'email' => 'Email',
    'password' => 'Пароль',
    'password confirmation' => 'Подтверждение пароля',
    'passwords must be same' => 'Пароли должны совпадать',
    'password must contain' => 'Пароль должен содержать',
    'pwd rules' => [
        'length' => 'Не менее 8 символов',
        'upper letters' => 'Не менее 1 заглавной буквы',
        'digit' => 'Не менее 1 цифры'
    ],
    'no account?' => 'Нет аккаунта?',
    'register!' => 'Зарегистрируйтесь!',
    'enter' => 'Вход',
    'registration' => 'Регистрация',
    'first name' => 'Имя',
    'last name' => 'Фамилия',
    'how call you' => 'Как к вам обращаться?',
    'letter will be sent' => 'На данный email будет выслано письмо для подтверждения регистрации',
    'birth date' => 'Дата рождения',
    'choose image' => 'Выберите изображение',
    'change image' => 'Изменить изображение',

    'register' => 'Зарегистрироваться',
    'gender' => 'Пол',
    'genders' => [
        'male' => 'Мужчина',
        'female' => 'Женщина'
    ],

    'placeholders' => [
        'first name' => 'Иван',
        'last name' => 'Иванов'
    ],
    'thanks' => 'Спасибо за регистрацию!',
    'you can now' => 'Теперь вы можете',
    'enter account' => 'войти в аккаунт',
    'error404' => 'Страница не найдена. Ошибка 404',
    'profile' => 'Профиль',
    'change profile' => 'Изменить профиль',
    'save' => 'Сохранить',
    'validation' => [
        'required' => 'Это поле обязательно для заполнения',
        'email' => 'Введите валидный email адрес',
        'date' => 'Введите валидную дату (например, 2020-12-30)',
        'min' => 'Пароль должен содержать не менее 8 символов',
        'same' => 'Пароли должны совпадать',
        'regex_password' => 'Пожалуйста, убедитесь в том, что ваш пароль следуют правилам',
        'email exists' => 'Пользователем с таким email уже существует'
    ],
    'filemaster' => [
        'invalid' => 'Неверный тип файла',
        'no file' => 'Выберите файл',
        'too large' => 'Превышен лимит размера файла',
        'failed' => 'Не удалось загрузить файл',
        'size limit' => 'Размер файла не должен превышать ',
        'kb' => 'Кб'
    ],
    'email not found' => 'Пользователь с таким email не найден',
    'wrong password' => 'Неверный пароль'
];